programming/version-control/conventional.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>conventional.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/programming/version-control">Up: version-control</a>
	  	
	</span>

	<span id="next">
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="changelog"><span class="todo TODO">TODO</span> CHANGELOG</h1>
<p><a href="http://keepachangelog.com/en/0.3.0/">http://keepachangelog.com/en/0.3.0/</a></p>
<h1 id="semver">SemVer</h1>
<p><a href="http://semver.org/">http://semver.org/</a></p>
<h1 id="conventional-commit">Conventional Commit</h1>
<p>Refer to <a href="https://www.conventionalcommits.org/en/v1.0.0-beta.2/">https://www.conventionalcommits.org/en/v1.0.0-beta.2/</a></p>
<ol class="incremental">
<li>Prefix the commit title with a type (<code>feat</code>, <code>fix</code>, etc)
<ol class="incremental">
<li><code>feat</code> for adding a new feature</li>
<li><code>fix</code> for a bug fix</li>
</ol></li>
<li>An optional scope after the type and enclosed in parenthesis (<code>fix(parser)</code>)</li>
<li>A description follow the type/scope prefix, e.g. <code>fix: array parsing issue when multiple spaces were contained in string.</code></li>
<li>An optional longer commit body, begin one blank line after the description</li>
<li>An optional footer after the body, contains additional issue references about the code changes</li>
<li>Breaking changes should be marked by prefixing <code>BREAKING CHANGE</code> at the begining of the footer or body section of a commit</li>
</ol>

      </div>
    </section>
  </body>
</html>
